#+TITLE: Org-babel

* Org-babel

** Hello world

In insert mode, press TAB with the cursor after <s (so type '<', 's', TAB)
to quickly create a source code block.  Press 'C-c C-c' while on the code block
to evaluate the code.
#+BEGIN_SRC sh
echo "Hello world it's $(date)"
#+END_SRC

#+RESULTS:
: Hello world it's Wed Jul 18 01:30:54 EDT 2018


** Exporting
*** Just the code
To control what goes into exported files, do like this
#+BEGIN_SRC sh :exports code
echo "Hello world it's $(date)"
#+END_SRC

#+RESULTS:
: Hello world it's Wed Jul 18 01:30:54 EDT 2018

*** Just the results
Or do like this
#+BEGIN_SRC sh :exports results
echo "Hello world it's $(date)"
#+END_SRC

#+RESULTS:
: Hello world it's Wed Jul 18 01:30:54 EDT 2018
*** Both
Or do like this
#+BEGIN_SRC sh :exports both
echo "Hello world it's $(date)"
#+END_SRC

#+RESULTS:
: Hello world it's Wed Jul 18 01:30:54 EDT 2018

* Editing code in separate buffer : 'C-c ,'
#+BEGIN_SRC python
def say_hello(name):
    return "hello " + name
return say_hello("world")
#+END_SRC

#+RESULTS:
: hello world

* Tangle
#+BEGIN_SRC python :tangle test/org-python-test.py
def say_hello(name):
    return "hello " + name
return say_hello("world")
#+END_SRC

#+RESULTS:
: hello world

